#include <stdio.h>

// 주석이 필요한 단계라 느껴 다는 주석의 그 첫 번째 - O(1)
/*
    문제의 의사코드:
    ```
    MenOfPassion(A[], n) {
        i = ⌊n / 2⌋;
        return A[i]; # 코드1
    }
     ```

    O(1) - 상수 시간(Constant Time)
    데이터가 얼마나 많아지든 컴퓨터가 해야 할 일의 양이 늘어나지 않는 것.
    가장 이상적인 속도라고도 할 수 있다.

    가장 대표적인 것으로 꼽을 수 있는 것:
    - 해시 테이블에서 키로 값을 찾는 것.
    - 배열에서 인덱스로 값을 찾는 것.
*/

int main() {
    int _;
    scanf("%d", &_);
    printf("1\n"); // O(1) - 수행시간은 언제나 1
    printf("0\n"); // 최고 차항의 차수 - 상수항으로만 이루어져 있기 때문에 없음 

    return 0;
}